# classwork task1 - SoftServe4 - Lesson4

# 1.1 # виведе парні цифри від 0 (while)

a = 0 # цикл з основою на додаванні 2ки до стартового числа 0
while a <= 100:
	print (a)
	a += 2 # a = a + 2

# 1.2 # виведе всі непарні цифри від 1 (while)

a = 1 # цикл з основою на додаванні 2ки до стартового числа 1
while a <= 100:
	print (a)
	a += 2

# 1.3 # виведе всі непарні цифри від 1 (for)

for a in range (1, 100): # 1 - число початку діапазону, 100 - число кінця діапазону
	a += 1
	if (a % 2) == 0:
		print (a)
	else:
		pass












